{
  "comment1": "You can either set these values as environment variables or to a file called '.config.json' at the root of the repo",
  "commnet2": "Others constant values can be added without code changes just by adding them here",
  "AZURE_CLIENT_ID": "00000000-0000-0000-0000-000000000000",      //the clientId of the SPN used for deployments in Azure
  "AZURE_TENANT_ID": "00000000-0000-0000-0000-000000000000",      // the tenantId of the SPN used for deployments in Azure
  "AZURE_CLIENT_SECRET": "00000000-0000-0000-0000-000000000000",  //the password for the SPN used for deployments in Azure
  "AZURE_SUBSCRIPTION_ID": "00000000-0000-0000-0000-000000000000",//subscription to use for deployments
  "AZURE_REGION": "westus", // this the region to use for template deployments
  "TEST_RESOURCE_GROUP_NAME": "template-bot-rg-for-validate", //this is the resourceGroup used to call the /validate api - it must already exist (we should probab fix this to use the created one)
  "RESOURCE_GROUP_NAME_PREFIX": "qstci-", // the prefix used for naming resourceGroups created during CI test deployments
  "MONGO_URL": "mongodb://localhost:27017/arm-validator", // the database used to store metadata about deployments created during CI
 
  "GITHUB_REPO": "Azure/azure-quickstart-templates", // the repo being used for grabbing PRs for CI
  "GITHUB_CLIENT_ID": "00000000-0000-0000-0000-000000000000",     // clientId for the repo (if it's not public)
  "GITHUB_CLIENT_SECRET": "00000000-0000-0000-0000-000000000000", // client secret (if it's not public) 

  // Below here are the tokens used to generate parameter values during CI
  "PARAM_REPLACE_INDICATOR": "GEN-UNIQUE",  // generates a unique string
  "GUID_REPLACE_INDICATOR": "GEN-GUID",  // generates a GUID
  "PASSWORD_REPLACE_INDICATOR": "GEN-PASSWORD", // generates a complex password
  "ENV_PREFIX_REPLACE_INDICATOR": "GEN-", // this prefix precedes all the others below and is used to indicate that a parameter value should be generated by CI
  "SSH_KEY_REPLACE_INDICATOR": "GEN-SSH-PUB-KEY", // keyword to use to generate an ssh public key
  "SSH_PUBLIC_KEY": "ssh-rsa create an ssh public key using ssh-keygen", // the SSH key generated, we really don't generate a key for some reason - we pull it from here

  "VHDRESOURCEGROUP-NAME": "Existing resource group with pre-created resources", // resource group that contains VHD prereqs - other resources are also stored here
  "VHDSTORAGEACCOUNT-NAME" : "Existing storage account with in the resource group",  // the storage account that contains VHDs used for CI 
  "SPECIALIZED-WINVHD-URI": "Specialized Windows VHD URI. This should be in same region as of deployments.", // specialized VHDs used for deployment - this MUST reside in the AZURE_REGION above
  "GENERALIZED-WINVHD-URI": "Generalized Windows VHD URI. This should be in same region as of deployments.", // generalized VHDs used for deployment - this MUST reside in the AZURE_REGION above
  "DATAVHD-URI": "Data disk VHD URI. This should be in same region as of deployments.", // datadisk VHDs used for deployment - this MUST reside in the AZURE_REGION above
  
  // KeyVault params - all of these refer to the same keyvault and MUST reside in AZURE_REGION above
  "KEYVAULT-NAME" : "Name of key vault",  //resource name
  "KEYVAULT-FQDN-URI" : "the uri of the keyvault used by CI https://keyvalutname.keyvault.azure.net", //URI of the vault
  "KEYVAULT-RESOURCE-ID" : "ARM resourceId for key vault", //resourceId of the value
  "KEYVAULT-SSL-SECRET-NAME" : "Secret name for SSL certificate in key vault", //name of a secret in the vault that contains an SSL cert to use for test deployments
  "KEYVAULT-SSL-SECRET-URI" : "URI for SSL certificate secret in key vault",   //uri of a secret in the vault that contains an SSL cert
  
  "CUSTOM-FQDN-NAME" : "Fully qualified custom domain name, properly configured with CNAME mapping", // ###AM:armvalidator17384.spektrademos.com, CNAME created already in public DNS mapping it to armvalidator17384.azurewebsites.net
  "CUSTOM-WEBAPP-NAME": "First part of custom fqdn name", // example? ###AM:armvalidator17384 - this will become webapp name, to support above value.
  "CUSTOM-DOMAIN-SSLCERT-PASSWORD": "SSL certificate password",
  "CUSTOM-DOMAIN-SSLCERT-THUMBPRINT": "SSL certificate thumbprint",
  "CUSTOM-DOMAIN-SSLCERT-PFXDATA": "SSL certificate PFX data in base 64 encoded format"

}